In [2]:
import numpy as np
np.linspace(0,5,15)

array([0.        , 0.35714286, 0.71428571, 1.07142857, 1.42857143,
       1.78571429, 2.14285714, 2.5       , 2.85714286, 3.21428571,
       3.57142857, 3.92857143, 4.28571429, 4.64285714, 5.        ])

In [3]:
np.logspace(0,3,4)

array([   1.,   10.,  100., 1000.])

In [11]:
import pandas as pd
cols=['name','age']
df=pd.DataFrame([["arghya",18],["sumit",19],["sourav",16],["toton",15]],columns=cols)
df

     name  age
0  arghya   18
1   sumit   19
2  sourav   16
3   toton   15

In [12]:
df[df.age<20]

     name  age
0  arghya   18
1   sumit   19
2  sourav   16
3   toton   15